# BOOKS

## Design an ERD

- ERD created for the assignment

![png](ERD%20/books_ERD.png)

## Generate Forward Engineering Script

- Exported the .SQL creation script as "Forward Engineer SQL CREATE Script.sql" and saved it into the assignment repository. (Use File > Export)

![comfirm database](ERD%20/Confirmed%20new%20database.png)

## Insert data into the database with Python

In [2]:
# Import packages
import pymysql
pymysql.install_as_MySQLdb()
import pandas as pd
from sqlalchemy import create_engine
import json

In [3]:
with open('/Users/kellyji/.secret/sqllogin.json') as f:
    login = json.load(f)
db_name = "books"
connection = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [4]:
# Check connection
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

### Loading the Raw Data File

In [5]:
# Loading raw data for users
users = pd.read_csv('Use File/raw data/users  - users.csv')
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [6]:
# DESCRIBE Table
q = """ DESCRIBE users"""
describe=pd.read_sql(q,conn)
describe

        Field         Type Null  Key Default           Extra
0     user_id          int   NO  PRI    None  auto_increment
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [7]:
describe['Field'].values

array(['user_id', 'first_name', 'last_name', 'email'], dtype=object)

In [8]:
users.columns

Index(['id', 'first_name', 'last_name', 'email'], dtype='object')

In [9]:
# Rename columns to match SQL table
rename_map = {"id":"user_id"}
users = users.rename(rename_map,axis=1)
users.head()

   user_id first_name  last_name                 email
0        1       John        Doe          JD@books.com
1        2      Robin      Smith       Robin@books.com
2        3     Gloria  Rodriguez  grodriquez@books.com

In [10]:
# Check data types
describe[['Field','Type']]

        Field         Type
0     user_id          int
1  first_name  varchar(45)
2   last_name  varchar(45)
3       email  varchar(45)

In [11]:
users.dtypes

user_id        int64
first_name    object
last_name     object
email         object
dtype: object

- All data types matches

In [15]:
users = users.drop_duplicates(subset='user_id')

In [ ]:
users.to_sql("users",conn,index=False, if_exists='append')

In [18]:
# confirm the data has been added
q = """SELECT * FROM users;"""
pd.read_sql(q,conn)

   user_id first_name  last_name                 email
0        1       John        Doe          JD@books.com
1        2      Robin      Smith       Robin@books.com
2        3     Gloria  Rodriguez  grodriquez@books.com

---

In [19]:
# Loading raw data for authors
authors = pd.read_csv('Use File/raw data/authors - authors.csv')
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [20]:
# DESCRIBE Table
q = """ DESCRIBE authors"""
describe=pd.read_sql(q,conn)
describe

         Field         Type Null  Key Default           Extra
0    author_id          int   NO  PRI    None  auto_increment
1  author_name  varchar(45)  YES         None

In [21]:
describe['Field'].values

array(['author_id', 'author_name'], dtype=object)

In [22]:
authors.columns

Index(['id', 'author_name'], dtype='object')

In [23]:
# Rename columns to match SQL table
rename_authors = {"id":"author_id"}
authors = authors.rename(rename_authors,axis=1)
authors.head()

   author_id        author_name
0          1       Stephen King
1          2  F.Scott Fitgerald
2          3        Jack London
3          4        Jane Austen
4          5       Mary Shelley

In [24]:
describe[['Field','Type']]

         Field         Type
0    author_id          int
1  author_name  varchar(45)

In [25]:
authors.dtypes

author_id       int64
author_name    object
dtype: object

In [62]:
# Insert data into database
authors.to_sql("authors",conn,index=False, if_exists='append')

5

In [26]:
# confirm the data has been added
q = """SELECT * FROM authors;"""
pd.read_sql(q,conn)

   author_id        author_name
0          1       Stephen King
1          2  F.Scott Fitgerald
2          3        Jack London
3          4        Jane Austen
4          5       Mary Shelley

---

In [27]:
# Loading raw data for books
books = pd.read_csv('Use File/raw data/books - books.csv')
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [28]:
# DESCRIBE Table
q = """ DESCRIBE books"""
describe=pd.read_sql(q,conn)
describe

       Field         Type Null  Key Default           Extra
0    book_id          int   NO  PRI    None  auto_increment
1      title  varchar(45)  YES         None
2  author_id          int  YES  MUL    None

In [29]:
describe['Field'].values

array(['book_id', 'title', 'author_id'], dtype=object)

In [30]:
books.columns

Index(['id', 'title', 'author_id'], dtype='object')

In [31]:
# Rename columns to match SQL table
rename_books = {"id":"book_id"}
books = books.rename(rename_books,axis=1)
books.head()

   book_id                 title  author_id
0        1           The Shining          1
1        2                    It          1
2        3      The Great Gatsby          2
3        4  The Call of the Wild          3
4        5   Pride and Prejudice          4

In [32]:
describe[['Field','Type']]

       Field         Type
0    book_id          int
1      title  varchar(45)
2  author_id          int

In [33]:
books.dtypes

book_id       int64
title        object
author_id     int64
dtype: object

In [34]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, conn)

   @@FOREIGN_KEY_CHECKS
0                     1

In [56]:
# Changing the setting for FOREIGN_KEY_CHECKS with pd.read_sql
q = """SET @@FOREIGN_KEY_CHECKS=0"""
pd.read_sql(q,conn)

ResourceClosedError: This result object does not return rows. It has been closed automatically.

In [58]:
# Insert data into database
books.to_sql("books",conn,index=False, if_exists='append')

6

In [35]:
# confirm the data has been added
q = """SELECT * FROM books;"""
pd.read_sql(q,conn)

   book_id                 title  author_id
0        1           The Shining          1
1        2                    It          1
2        3      The Great Gatsby          2
3        4  The Call of the Wild          3
4        5   Pride and Prejudice          4
5        6          Frankenstein          5

---

In [36]:
# Loading raw data for favorites
favorites = pd.read_csv('Use File/raw data/favorites - favorites.csv')
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [37]:
# DESCRIBE Table
q = """ DESCRIBE favorites"""
describe=pd.read_sql(q,conn)
describe

     Field Type Null  Key Default Extra
0  book_id  int  YES  MUL    None
1  user_id  int  YES  MUL    None

In [38]:
describe['Field'].values

array(['book_id', 'user_id'], dtype=object)

In [39]:
favorites.columns

Index(['user_id', 'book_id'], dtype='object')

In [40]:
describe[['Field','Type']]

     Field Type
0  book_id  int
1  user_id  int

In [41]:
favorites.dtypes

user_id    int64
book_id    int64
dtype: object

In [42]:
# Insert data into database
favorites.to_sql("favorites",conn,index=False, if_exists='append')

7

In [43]:
# Check table to make sure data is inserted correctly
q = """ SELECT * FROM favorites"""
pd.read_sql(q,conn)

    book_id  user_id
0         1        1
1         2        1
2         3        1
3         4        2
4         5        2
5         5        3
6         6        3
7         1        1
8         2        1
9         3        1
10        4        2
11        5        2
12        5        3
13        6        3

## Part 4: Testing the Database

In [44]:
# Run the "SHOW TABLES"
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

- write a query at the end of your Jupyter Notebook to list the titles of all of John Doe's favorite books.

In [45]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.book_id = favorites.book_id
WHERE favorites.user_id = (SELECT user_id FROM users WHERE users.last_name ='Doe' AND users.first_name = 'John')
"""
pd.read_sql(q,conn)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1
3       The Shining        1
4                It        1
5  The Great Gatsby        1